app/Helpers/LogActivity.php

    public function createLog($model, $subject, $replace = [], $record_id = 0)
    {
        if(request()->route() == null){
            $controller = "Command";
            $action     = "Command";
        }else{
            $controller = class_basename(request()->route()->action['controller']);
            list($controller, $action) = explode('@', $controller);
        }

        return \App\LogActivity::create([
            "model"         =>  $model,
            "subject"       =>  trans($subject, $replace, 'tr'),
            "subject_en"    =>  trans($subject, $replace, 'en'),
            "url"           =>  request()->fullUrl(),
            "controller"    =>  $controller,
            "action"        =>  $action,
            "method"        =>  request()->method(),
            "ip"            =>  request()->ip(),
            "agent"         =>  request()->userAgent(),
            "record_id"     =>  $record_id,
            "user_id"       =>  auth()->check() ? auth()->user()->id : 0,
            "created_at"    => date('Y-m-d H:i:s')
        ]);
---
insert into `log_activities` (`model`, `subject`, `subject_en`, `url`, `controller`, `action`, `method`, `ip`, `agent`, `record_id`, `user_id`, `created_at`) values ('Consignee', 'Zara adında bir sevk yapılacak firma güncellenmiştir.', 'A company called Zara has been updated.', 'http://127.0.0.1:8000/consignee/1', 'ConsigneeController', 'update', 'PATCH', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/106.0.0.0 Safari/537.36', 1, 1, '2022-10-19 13:34:51')