app/Http/Controllers/ConsigneeController.php

    public function index(){

        if(roleCheck(config('settings.roles.admin')))
        {
            $consignees = Consignee::with(['companies'])->get();
---
select * from `consignees` where `consignees`.`deleted_at` is null
select `companies`.*, `company_consignee`.`consignee_id` as `pivot_consignee_id`, `company_consignee`.`company_id` as `pivot_company_id` from `companies` inner join `company_consignee` on `companies`.`id` = `company_consignee`.`company_id` where `company_consignee`.`consignee_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18) and `companies`.`deleted_at` is null