app/Http/Controllers/ConsignmentController.php

select * from `companies` where `companies`.`id` = 1 and `companies`.`deleted_at` is null limit 1
select `consignees`.*, `company_consignee`.`company_id` as `pivot_company_id`, `company_consignee`.`consignee_id` as `pivot_consignee_id` from `consignees` inner join `company_consignee` on `consignees`.`id` = `company_consignee`.`consignee_id` where `company_consignee`.`company_id` in (1) and `consignees`.`deleted_at` is null
---
    public function store(Request $request){

        ini_set('memory_limit','-1');
        ini_set('max_execution_time', '-1');

        switch ($request->get('process')) {

            case 'consigmentZara':

                $company = \App\Company::with(['consignees'])->find(auth()->user()->company_id);

select * from `companies` where `companies`.`id` = 1 and `companies`.`deleted_at` is null limit 1
select `consignees`.*, `company_consignee`.`company_id` as `pivot_company_id`, `company_consignee`.`consignee_id` as `pivot_consignee_id` from `consignees` inner join `company_consignee` on `consignees`.`id` = `company_consignee`.`consignee_id` where `company_consignee`.`company_id` in (1) and `consignees`.`deleted_at` is null
---

            case 'consigmentDc':

                $company = \App\Company::with(['consignees'])->find(auth()->user()->company_id);

select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `consignees` where `consignees`.`id` in (13) and `consignees`.`deleted_at` is null
select * from `orders` where `orders`.`id` in (2) and `orders`.`deleted_at` is null
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
---
    public function show($id){

        if($this->roleCheck(config('settings.roles.uretici'))){ //üretici
            $consignment = Consignment::where('company_id', auth()->user()->company_id)
                ->with(['company', 'order', 'consignee', 'created_user'])
                ->withCount(['items'])
                ->findOrFail($id);