app/Http/Controllers/HomeController.php

    public function adminIndex()
    {
        $companies = Company::where('status', 1)->where('main_company_id',0)->get();
        if ($companies) {
            $this->data['companies'] = $companies;
        }

        $consignments = Consignment::orderBy('created_at')
        ->where("created_at", ">", Carbon::now()->subMonths(6))
        ->get()
        ->groupBy(function ($val) {
            return Carbon::parse($val->created_at)->translatedFormat('F');
        });
      if ($consignments) {
          $this->data['consignments'] = $consignments;
      }

      $maxConsignments = Consignment::with(['company'])->where('company_id', '!=', 0)->select('company_id', \Illuminate\Support\Facades\DB::raw('count(company_id) as total'))->groupBy('company_id')->orderBy('total', 'desc')->limit(3)->get();
---
select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null