app/Http/Controllers/StationController.php

select * from `devices` where `company_id` = 1 and `status` = 1 and `devices`.`deleted_at` is null
---
    public function device()
    {
            if (!auth()->user()->company_id || auth()->user()->company_id == 0) {
                session()->flash('flash_message', array(trans('station.failed'), trans('station.auth_company_fail'), 'error'));
                auth()->logout();
                return redirect()->route('station.index');
            }

            $devices = \App\Device::where('company_id', auth()->user()->company_id)->where('status','!=', 2)->get();

select * from `consignees` where `consignees`.`id` = 3 and `consignees`.`deleted_at` is null limit 1
select * from `view_screens` where `id` = 2 limit 1
---
    public function viewSor(Request $request)
    {

        // Gelen consignee ye ait view id den read ekranı alınıyor.
        // Diğer seçeneği seçilirse default olan ekranın ekleme ekranı alınıyor.
        $viewCon = $request->get('consingneeId');
        if ($viewCon != 'other') {

            $consignee = \App\Consignee::find((int)$viewCon);
            $reading = \App\ViewScreen::where('id', $consignee->viewid)->limit(1)->get();

select * from `consignees` where `consignees`.`id` in (4, 13) and `consignees`.`deleted_at` is null
select * from `consignments` where `status` = 1 and `company_id` = 1 and `consignments`.`deleted_at` is null order by `id` desc
select * from `orders` where `orders`.`id` in (1, 2) and `orders`.`deleted_at` is null
---
    public function index7(){

        $consignments = \App\Consignment::where('status', true)
            ->where('company_id', auth()->user()->company_id)
            ->with(['consignee', 'order'])
            ->orderBy('id', 'desc')
            ->get();

select * from `box_types`
---
    public function ajax(Request $request)
    {

        ini_set('memory_limit', '-1');
        ini_set('max_execution_time', '-1');

        // ajax with sent task ->  process
        switch ($request->get('process')) {

            /*
            * @desc    all boxtypes
            * @param   not parameter
            * @return  array convert json
            */

            case 'getBoxTypes':

                $boxTypes = BoxType::get();

select count(*) as aggregate from `notifications` where `company_id` = 1 and `read_web` = 0
---

            case 'notificationCheck' :

                $notifications = \App\Notification::where('company_id', auth()->user()->company_id)
                    ->where('read_web', false)
                    ->count();

select count(*) as aggregate from `ms_carton_epcs` where `consigment_id` = '1' and `deleted_at` is null
---
                    if ($request->has('consignmentId')) {

                        $consignmentId = $request->get('consignmentId');
                        $totalQuery = \App\MsCartonEpc::where('consigment_id', $request->get('consignmentId'))
                            ->whereNull('deleted_at')
                            ->count();

select count(*) as aggregate from `packages` where `consignment_id` = '2' and `package_no` = 2 and `packages`.`deleted_at` is null
---
                        $load_type = $request->get('load_type');

                        //paket kontrol
                        $packages = \App\Package::where('consignment_id', $request->get('consignmentId'))
                            ->where('package_no', $packageNo)
                            ->count();

select count(*) as aggregate from `items` where `consignment_id` = '2' and `epc` in ('BB0000000015730000001140') and `deleted_at` is null and `items`.`deleted_at` is null
---
                        }

                        //epc kontrol
                        $items = \App\Item::where('consignment_id', $request->get('consignmentId'))
                            ->whereIn('epc', collect($epc_list)->pluck('epc'))
                            ->whereNull('deleted_at')
                            ->count();

insert into `packages` (`company_id`, `consignment_id`, `order_id`, `package_no`, `model`, `box_type_id`, `load_type`, `size`, `device_id`, `created_user_id`, `created_at`, `updated_at`) values (1, '2', '2', 2, '', '', '', '', 6, 1, '2022-10-19 17:29:13', '2022-10-19 17:29:13')
---
                        $package->device_id = session('device.id');
                        $package->created_user_id = auth()->user()->id;
                        $package->created_at = date('Y-m-d H:i:s');
                        if ($package->save()) {

insert into `items` (`company_id`, `consignment_id`, `created_at`, `created_user_id`, `device_id`, `epc`, `gtin`, `order_id`, `package_id`) values (1, '2', '2022-10-19 17:29:13', 1, 6, 'BB0000000015730000001140', '219648', '2', 8)
---
                                    'created_user_id' => auth()->user()->id
                                ];
                            }
                            \App\Item::insert($item_data);

select `id`, `package_no`, `model`, `size`, `load_type`, `box_type_id` from `packages` where `consignment_id` is null and `packages`.`deleted_at` is null order by `id` desc
---

                if ($request->has("consignmentId")) {

                    $packages = \App\Package::select('id', 'package_no', 'model', 'size', 'load_type', 'box_type_id')
                        ->where('consignment_id', $request->get('consignmentId'))->with(['items'])
                        ->orderBy('id', 'desc')
                        ->get();

update `packages` set `box_type_id` = 'SC4c', `load_type` = 'Solid', `packages`.`updated_at` = '2022-10-19 17:36:15' where `id` = '21' and `packages`.`deleted_at` is null
---

                    $boxType = $request->get('box_type_id');
                    $loadType = $request->get('load_type');
                    $package = \App\Package::where('id', $request->get('packageId'))->update([
                        'box_type_id' => $boxType,
                        'load_type' => $loadType
                    ]);

select * from `consignees` where `consignees`.`id` in (4) and `consignees`.`deleted_at` is null
select * from `consignments` where `status` = 1 and `company_id` = 1 and `id` = '1' and `consignments`.`deleted_at` is null order by `id` desc
select * from `orders` where `orders`.`id` in (1) and `orders`.`deleted_at` is null
---

            case 'getTotalCountBar':

                $consignments = \App\Consignment::where('status', true)
                    ->where('company_id', auth()->user()->company_id)
                    ->where('id', $request->get('consigment_id'))
                    ->with(['consignee', 'order'])
                    ->orderBy('id', 'desc')
                    ->get();