app/Providers/MenuServiceProvider.php

select * from `menus` where `menus`.`parent_id` in (1, 2, 3, 4, 5, 6, 7, 17) order by `sort` asc
select `roles`.*, `menu_role`.`menu_id` as `pivot_menu_id`, `menu_role`.`role_id` as `pivot_role_id` from `roles` inner join `menu_role` on `roles`.`id` = `menu_role`.`role_id` where `menu_role`.`menu_id` in (8, 9, 10, 11, 12, 13, 14, 15, 16)
---
    public function boot()
    {

        view()->composer('*', function($view) {

            $menus = Cache::remember('glb_menus', 3600, function () {
                return Menu::where('parent_id', 0)
                    ->with(['children', 'roles'])
                    ->orderBy('sort')
                    ->get();